{"pages":[{"title":"","text":"Hi there 👋My name is Luchao Qi, I am thrilled and excited about exploring the fields of Machine Learning, Deep Learning (NLP &amp; CV &amp; RL), Next Generation Sequencing (NGS), and Algorithm Design for solving real-world problems having profound implications. Feel free to check out my project portfolio for details. I am the kind of person who goes sleepless when introduced to any interesting new technology, with a burning and devoted urge to pursue research in that area. Given any problem, I always try to solve it with efficiency to the most intricate levels of the problem. Comfortable languages: R (Shiny), Python, SQL, Shell Scripting","link":"/index.html"},{"title":"","text":"Associations between Body Mass Index (BMI) and Accelerometer Time Series Data: National Health and Nutrition Examination Survey (NHANES) 2005-2006 (Submitted to Sensors) L. Qi, Q. Zhang, Y. Tan, K. H. Lam, H. Zheng and M. Qian, “Non-Contact High-Frequency Ultrasound Microbeam Stimulation: A Novel Finding and Potential Causes of Cell Responses,” in IEEE Transactions on Biomedical Engineering, vol. 67, no. 4, pp. 1074-1082, April 2020, doi: 10.1109/TBME.2019.2929008.https://ieeexplore.ieee.org/abstract/document/8764483 L. Qi et al., “Calcium fluorescence response of human breast cancer cells by 50-MHz ultrasound microbeam stimulation,” 2017 IEEE International Ultrasonics Symposium (IUS), Washington, DC, 2017, pp. 1-3, doi: 10.1109/ULTSYM.2017.8091686.https://ieeexplore.ieee.org/abstract/document/8091686","link":"/publications/index.html"},{"title":"categories","text":"","link":"/categories/index.html"},{"title":"","text":"R PackagesMRIPCA: Principal component analysis (PCA) on MRI data MRIcloudT1volumetrics: T1 volumetric analysis of MRIcloud output R Shiny Web ApplicationsShiny_clustering: Clustering analysis using K-means, PCA, T-sne, and Umap BMI_calculator: BMI calculation","link":"/software/index.html"},{"title":"","text":"2021Python game in terminal: spaceship dodging Crypto Price Prediction 2020Signal Processing: Audio-Based Dialysis Fistula Assessment Gaussian Graphical Model: Conditional Dependency in MRI data Reinforcement Learning: Super Mario Bros Computer Vision: CNN CIFAR-100 google colab code 2019Natural Language Procession: Detection of suspicious or fake Amazon product reviews Time series analysis on accelerometer data: National Health and Nutrition Examination Survey Next Generation Sequencing: finding co­-occurring or mutually exclusive mutated driver genes across different cancer types using statistical tests R package: Volumetric analysis of MRIcloud output 2018Next Generation Sequencing: RNA-seq pipeline R shiny web app: gene clustering analysis 2016Differentiating invasion potential of breast cancer cells using high-frequency ultrasound stimulation https://ieeexplore.ieee.org/document/8764483 https://ieeexplore.ieee.org/document/8091686","link":"/projects/index.html"},{"title":"tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"2021 Year End Recap","text":"2021May Power Advocate OA all in medium / easy levels BUT need to solve 10 problems in 1h; need to brush up on my SQL skills Baanyan Software Services Tick Tock Networks D&amp;D pharmatech - Valted Seq April YipitData follow ups - five rounds of follow ups on task 2 April LeetCoding Challenge 2021 - badge earned NHANES - incorporating suggestions from Andrew Crypto March YipitData OA Goldman Sachs OA (Height Check / K-diff Pairs) - cracked all the problems in 15 mins (1.5h limited) since solved exactly same questions on leetcode before - rejected 2 weeks later without any feedback - Don’t be an out-player next time because it makes non-technical HR doubt over plagiarism Leetcode DP NHANES manu sent out to coauthors (need to add new wave 2005-2006) February NHANES Manu rewording @Brian Leetcode Ekohealth follow-on work - VAM conference Baanyan Software Services Neuralink Linkedin networking - phone call Orangetheory Fitness OA - K-diff Pairs in an Array Proton.ai OA January PhD EU Docker Leetcode AB Testing NHANES Side project: timeline visualization - code uploaded to deepnote plotly + chart_studio How python deals with module and package having the same name? debugging: sys.path Job application","link":"/blog/2021-Year-End-Recap/"},{"title":"Ekohealth","text":"Review of Dialysis Access ProjectLuchao Qi September 2020 - December 2020 Some of links are for internal Eko team use only, you may not able to check those code / documents. The final report is stored on google doc and project updates on Jira. Lessons learned: Priority: solutions &gt; problems It’s better to show results or proposals rather than technical problems / challenges incurred in the reports or presentations. Since managers are more focused on high-level output-driven problems which is defined by the nature of industry. Data: sample size / quality / feature engineering Data quality and feature engineering is the fundamental pillar in a project. Real-world data is not always ideal and will issue lots of problem during EDA e.g. unbalanced dataset / small sample size / unreliable ground truth. People usually spend most of bandwidth playing around algorithm part (hyperparameter tuning / optimization / …) which of course is important. But always keep in mind that the fundamental stuff decides the upper limits of algorithm performance. Project Description: Dialysis SBIR Phase I - Research StrategyBackground: Dialysis needs AV fistula / AV graft to get better treatment and this treatment could cause stenosis. To help give diagnosis, we are trying to find a way to detect stenosis using ML/DL algorithms. Stethoscope Recordings Audio recordings of the dialysis access flow will be performed for each subject in a standardized manner. Each subject will undergo 15-second recordings first over the site of the proximal anastomosis (or the only anastomosis, in the case of an AVF), and again 4 cm and 8 cm distally along the length of the fistula or graft. Device recording location will be documented for each recording using a form embedded in the Eko App. Stethoscope sound recordings will be collected by an expert auscultator (e.g. Dr. Morrissey, Dr. Kalloo, or Dr. Lazar) with substantial experience in listening to vascular blood flow sounds, and will retake the recording if they believe the sound quality is insufficient. As the device will allow visualization of the audio waveform during recording, the recorder will receive real-time feedback on the placement of the device over the blood vessel to maximize the quality of the recording at each position. To ensure that consistent pressure is applied, the observer will balance the stethoscope chest piece on the arm such that the only pressure applied is due to the force of gravity on the chest piece. Recordings made with the Eko CORE will use the Eko CORE’s active noise canceling functionality to remove ambient noise, further improving data quality. We will plan for periodic auditing of recordings by Eko’s data science team and by Dr. Morrissey to ensure adequate data quality. We anticipate that this flexibility and real-time feedback will improve the generalizability of the use of the device to a real-world (i.e. non-study) clinical situation. AlgorithmsLiterature reviewhttps://docs.google.com/presentation/d/1FXr7skZMgN76QkAGnEfhDtdeAvS-WFRRniO0-C9rybo/edit?usp=sharing Recording-based algorithms Features based on time-domain: statistics of envelope, zero-crossings Features based on frequency domain: MFCC, band power, statistics of frequency SVM Model performance: AUC ~ 0.7, PR AUC ~ 0.2 Visit-based algorithms We tried to reproduce similar methods (mainly ratio of bandpower features + SVM) in the paper: https://ieeexplore.ieee.org/document/6944653 While the results are not promising, there are still some necessities digging into the paper and figure out why. Some possible reasons could the data quality/feature engineering / … Among all the features constructed, the entropy of power density (K-L divergence) across 3 locations performs the best. SVM Model performance: AUC ~0.8, PR AUC ~ 0.6 Frequency filtering The unfiltered data and filtered data (30Hz - 800Hz) are stored on AWS and the aforementioned visit-based algorithms were applied on both data but there’s no big difference between the performance. Covariates We also tried using information from ultrasound reports including flow volume, peak systolic velocity, and blood vessel diameter to predict stenosis severity but the results are not promising. Those ML results and EDA results https://github.com/EkoDevices/algorithms/blob/develop/projects/dialysis_access/notebooks/columbia_data_visualization.ipynb make the ultrasound reports less reliable. Further Analysis Dynamic Time Warping can be worth trying if there’s more data available since that’s the main way clinical experts use to give diagnosis. Useful features from clinical side: change of pulsatility / sharpness / shape / amplitude Human Annotation Project Blinded experiments are set for experts listening to audios only and give diagnosis after the listening session.More details could be found here: doc Code to reproduce the results: [code](https://github.com/EkoDevices/algorithms/blob/develop/projects/dialysis_access/notebooks/Dialysis Access Annotation Project.ipynb) The goal is to re-annotate the data and to get human level performance when they were only able to access the audio data. Results from Dr. Nicholas J. Morrissey: Problems and Possible SolutionsGround truth Data labeling is the biggest problem so far because using ultrasound reports might not be reliable. The ultrasound reports classify stenosis severity into different categories e.g. Severe, Moderate, NHSS, … which doesn’t make a lot of sense when doing a sanity check. In other words, both NHSS and Severe data contain stenosis when listening to audio and even experts couldn’t differentiate between them well. Human annotation from the Columbia team shows similar results meaning that the ultrasound reports might not be enough labeling the data. Angiography should be the best solution we can find so far regarding the ground truth, especially considering the definition of stenosis (percentage change in diameter of the blood vessel). Number of recordings The ideal number of recordings would be 3 while there are occasions that the number of recordings is larger than 3 because doctors retake the recording if they believe the sound quality is insufficient. So it would be better to permit them to choose the most representative 3 recordings. There are currently ~300 recordings in total but only ~20 datasets (60 recordings) left after data cleaning for tranining. So the sample size is pretty small and we still need more enrollments. TimelineSome nitty-gritty details broken down by month December Final presentation Proposal for ground truth: angiography Final document / review Study design: further longitudinal study November Blinded experiments completed - the results are not promising and seem like experts can’t determine the stenosis severity listening to the audios only - or maybe because the definition of stenosis severity is confusing Johns Maidens Andrew Lazar Adam Saltman Nicholas J. Morrissey Include all the covariates information for the algorithm - doesn’t improve much Journal Club presentation No big difference between filtered and unfiltered (raw) data Need to figure out the definition of NHSS from ultrasound reports Internal Audit Training ML ensembling methods - not the priority Including band power related features hurts the performance Mean() / Var() on band power between recordings for each visit ROC AUC (&lt;0.5) worse than other methods October Reproduce similar methods in the paper: https://ieeexplore.ieee.org/document/6944653 Predict stenosis based on visits (3 recordings in and 1 out), not recordings (1 in and 1 out) - visits oriented (AUC ~ 0.8) Potential features mean / variation of central frequency and power ratio based on different thresholds (all methods mentioned in the paper) Pulsatility index (Hilbert transform) select patient and visit_index with n(recordings) == 3 for visits with more than 3 recordings, 3 of them are NHSS and 2 of them are Moderate mean/var of amplitudes / frequency group by patient_id / visit_index max/min of freq KL divergence spectrum / scipy.entropy Exploratory analysis: ratio between diameter/ flow volume / PSV instead of raw data take those ratios as the target instead of annotations from ultrasound reports? Get a deeper understanding of dialysis fistula from the clinical side: https://www.ajronline.org/doi/full/10.2214/AJR.15.14650 Blinded test for Columbia team https://docs.google.com/document/d/1Oa5hxrGdLQSRIKulNxNxpcni54ziSDxSbI93sJRMk6A/edit?usp=sharing Try different ML models - not the priority September Project background The research proposal fistula vs. graft Set up the coding environment and sign the documents (AWS/ Github / Gusto/ Guideline 401(k)) Get familiar with the data, understand the workflow Dig into the data and be prepared for the prototype of algorithms Focus on proximal at first and find if there’s any label recorded about positions Assume patients started recordings on the order of proximal, middle, and distal Data annotation problem: create better criteria for fistula (flow volumes not enough to diagnose patients with fistula) Found interesting label: Location of Stenosis Visualize the waveform/ spectrogram of recordings with fistula to intuitively understand the audio data Prepare for the presentation for the Clinical / Data Science weekly meeting literature survey - add references/notes to the table John made before content previous work 3 proposals Data annotation: Infer location of recording based on visit_index and number of recordings per visit. But it would be better if experts collecting data can provide that information (Jotform). Algorithm construction: Predict stenosis using covariates only (acc ~ 0.7) Fourier Transform - MFCC (Mel Frequency Cepstral Coefficient) Bandpower calculation and MFCCs completed. But the comparison between stenosis and non-stenosis seems not promising. Need to double check with the Columbia team regarding the data annotation part. Set up a meeting with the Columbia team and look forward to the updated spreadsheet on covariates data. DS deep dive presentation Statistics of the spectrogram (variation of frequency/mean) and statistics of amplitude reconstruct dataframe to match the flow volume to the recordings based on the location","link":"/blog/Ekohealth/"},{"title":"Git 101","text":"The following image shows a great explanation of how git works Lazily pull and pushIf you are running on the windows system, just save the following code as git.sh file and run the *.sh file with Git for Windows. 12345678910#!/usr/bin/env bash#find ./* -size +100M | cat &gt;&gt; .gitignore# How to use: double-click OR run the following command# ./git.sh &quot;Customize your own commitment&quot;git pullgit add .git commit -m &quot;${1:-Luchao&quot;'&quot;s auto-commitment using shell script}&quot;git push origin master # or other branches It also works like a charm in RStudio Manage subrepo without changing historyA lot of people already know how to add a subrepo using submodule and delete a submodule. But that’s how we manage “external” repos. (btw sometimes I just simply add the path of .git file under subrepo into the .gitignore file in the root folder) In the case we want to move our own repo into another root repo as a subrepo without losing history. I’ve tried a lot of methods and so far the following method I found works well and pretty convenient. Add the following code into your .bash_profile. In linux, edit .bashrc. 1234567891011121314151617181920212223242526function git-add-repo{ repo=&quot;$1&quot; dir=&quot;$(echo &quot;$2&quot; | sed 's/\\/$//')&quot; path=&quot;$(pwd)&quot; tmp=&quot;$(mktemp -d)&quot; remote=&quot;$(echo &quot;$tmp&quot; | sed 's/\\///g'| sed 's/\\./_/g')&quot; git clone &quot;$repo&quot; &quot;$tmp&quot; cd &quot;$tmp&quot; git filter-branch --index-filter ' git ls-files -s | sed &quot;s,\\t,&amp;'&quot;$dir&quot;'/,&quot; | GIT_INDEX_FILE=&quot;$GIT_INDEX_FILE.new&quot; git update-index --index-info &amp;&amp; mv &quot;$GIT_INDEX_FILE.new&quot; &quot;$GIT_INDEX_FILE&quot; ' HEAD cd &quot;$path&quot; git remote add -f &quot;$remote&quot; &quot;file://$tmp/.git&quot; git pull &quot;$remote/master&quot; git merge --allow-unrelated-histories -m &quot;Merge repo $repo into master&quot; --edit &quot;$remote/master&quot; git remote remove &quot;$remote&quot; rm -rf &quot;$tmp&quot;} source your .bash_profile/.bashrc and then 12cd &lt;root_folder aka main_repo&gt;git-add-repo https://github.com/example/example dir/to/save .gitignoreIgnoring a previously committed file git rm - fatal: pathspec did not match any files 12345678git add .gitignoregit commit -m 'add ignore file only'git push#.gitignore will work after pushing it to github and you can do further works after this stepgit pullgit add .git commit -m 'ignore file works'git push I usually separate setting the ignore file from syncing with github since I found git add . sometimes doesn’t work even though I have set up the .gitignore file correctly. To solve this, use git add $path to the specific files supposed to be ignored. For the syntax patterns, check out the resources here: Git ignore patternsBranches1git branch should show all the local branches of your repo. The starred branch is your current branch. If you just type git push, then the remote of the current branch is the default value. In some projects like covid19_projections, people usually create a separate branch for the github page.","link":"/blog/Git-101/"},{"title":"Farewell to the Johns Hopkins University","text":"I gained invaluable experience and knowledge at Hopkins. I’m always proud of being a blue jay and being grateful to our university. During those two years, I’ve met a lot of great people including Dan, Remy, Eric, Stanley, Mark, Ciprian, etc. Feel free to let me know if you think I might have missed you :) I wanted to express my special thanks to Dr. Brian Caffo. I learned not just knowledge but a lot of life lessons from him, from which I will definitely benefit for the rest of my life. I’m sure we all incurred some challenges along this journey, and we should believe We have to be greater than what we suffer. Hope it’s never too late to say thanks to everyone who helped me during my master’s and good-bye to JHU. On – can congratulations on all graduates’ degree and enjoy the commencement – I’m confident you will find an opportunity that you will thrive in.","link":"/blog/Farewell-to-the-Johns-Hopkins-University/"},{"title":"Hexo 101","text":"Tips and TricksCode chunk demosource/_post/some-post.md12345title: My first postdate: '2015-01-01 00:00:01'article: highlight: theme: atom-one-dark Hexo 5.** updates: Posts without title should be accessibleThis feature is just useless for me. Every time when I created a md file without title settings in the yaml, the website just can’t show the md file. (I just don’t wanna create a new post through the command like hexo new ) Change the file C:\\Users\\lcqi\\Desktop\\hexo\\node_modules\\hexo\\lib\\plugins\\processor\\post.js back to the previous version i.e. add the following commands in the file 123if (!data.title) { data.title = data.slug;} Integrate google analytics with Hexohttps://blog.zhangruipeng.me/hexo-theme-icarus/Plugins/Analytics/icarus-user-guide-web-analytics-plugins/ 为GitHub Pages自定义域名并添加SSL-开启https强制Simply create CNAME file in your source file. Don’t forget to make your website searchable: https://support.google.com/webmasters/answer/6065812 Porkbun UpdateI choose to buy my domain on porkbun and I just found it’s pretty easy to connect domain to Github Pages From domain to subdomainIn config file, change 1234567url: https://luchaoqi.github.ioroot: /deploy: type: git repo: https://github.com/LuchaoQi/luchaoqi.github.io branch: master to 1234567url: https://luchaoqi.github.io/blogroot: /blog/deploy: type: git repo: https://github.com/LuchaoQi/blog branch: master updates: for repo it’s better to use https://github.com/LuchaoQi/blog.git instead of https://github.com/LuchaoQi/blog Add an RSS feed to your blog when people want to subscribe your websitegoogle FeedBurnerhttps://blog.zhangruipeng.me/hexo-theme-icarus/Widgets/icarus-user-guide-widgets/#Subscribe-Email http://www.codeblocq.com/2015/12/Add-an-RSS-feed-to-your-hexo-blog/ https://theinsider.idxcentral.com/tutorials/other-tutorials/how-to-set-up-a-feedburner-account/ Make custom homepage instead of recent postshttps://github.com/hexojs/hexo/issues/1077#issuecomment-381304203 Confirming that simply creating an index.md file in the my-site/source folder allows me to change the homepage. I still wished to have a page which listed my most recent blog posts. So in my my-site/_config.yml I put 12index_generator: path: '/blog' After creating the file (and running hexo g hexo s), when I access localhost:4000, I get my custom homepage. And then when I access localhost:4000/my-site/blog, I get the “original” homepage listing my blog posts. I did not need to npm uninstall hexo-generator-index. I also did not need to create an html file, and did not need to do what @MoezGholami says above. Also, put toc:false in your front-matter - You can set the default values for front-matter in _config.icarus.yml. Display pdf file Move Resume.pdf file toC:\\Users\\lcqi\\Desktop\\hexo\\source Change settings in config file C:\\Users\\lcqi\\Desktop\\hexo\\themes\\icarus\\_config.yml 12345678navbar: # Naviagtion menu items menu: Home: / Archives: /archives Projects: /projects About: /about Resume: /Resume.pdf another solution deploy git repo https://github.com/LuchaoQi/Resume change the link to file https://luchaoqi.github.io/Resume/Resume/Resume.pdf note https://luchaoqi.github.io/Resume/ will show 404 error Easily create new postput the following *.sh file in your root directory and double click the *.sh file using Git for Windows 123456789101112131415161718#!/usr/bin/env bash#Just double click the bash file# current problem is concatenating the name if it contains spaces# e.g. test file.md but hexo n would creates test-file.md# a=&quot;test file&quot;# echo $a|sed 's/ /-/'# works# $x|sed 's/ /-/'|start &quot;&quot; source/_posts/&quot;$x&quot;# doesn't work# solved $(echo &quot;${x}.md&quot;|sed 's/ */-/')# https://askubuntu.com/a/985789read -r -p &quot;Your blog's name: &quot; xhexo n &quot;$x&quot;y=$(echo &quot;${x}.md&quot;|sed 's/ \\+/-/g')start &quot;&quot; source/_posts/&quot;$y&quot; Easily deploy and sync to githubdouble click the following *.sh file then all set! 12345678910111213#!/usr/bin/env bashgit pullgit add .git commit -m &quot;${1:-Luchao&quot;'&quot;s auto-commitment using shell script}&quot;git push origin masterhexo clean# hexo g# hexo s# hexo deploy --generatehexo generate --deploy Upload imageIf you prefer setting up your own image hosting service, check out following links: 如何搭建一个自己图床网站 Chevereto-Free Else checkout the following posts: https://github.com/liolok/hexo-asset-link https://liolok.github.io/en/How-to-Add-Image-to-Hexo-Blog-Post/ Insert Screenshot One common scenario is to edit *.md posts in static sites (like Jekyll) using Typora. In Typora, set the following preference so the image files goes into our target file In PicGo, you can upload your images to SM.MS. I would make a screenshot and then upload image with Ctrl Shift P. DONE! You can then paste the link already in your clipboard into your markdown file. Use sm.ms Typora now supports auto upload images https://support.typora.io/Upload-Image/ On win10, it doesn’t work very well so you need to do some extra work https://www.lzskyline.com/archives/87/ Config File: 12345678910111213{ &quot;picBed&quot;: { &quot;current&quot;: &quot;smms&quot;, &quot;uploader&quot;: &quot;smms&quot;, &quot;transformer&quot;: &quot;path&quot;, &quot;smms&quot;: { &quot;token&quot;: &quot;your token&quot; } }, &quot;picgoPlugins&quot;: { &quot;picgo-plugin-smms-user&quot;: true }} Update: I got the following error on a new PC 1@chcp 65001 &gt;nul &amp; cmd /d/s/c function(){return p}\\picgo\\win64\\picgo.exe u &quot;C:\\\\Users\\\\lcqi\\\\AppData\\\\Local\\\\Temp/typora-icon2.png&quot; &quot;C:\\\\Users\\\\lcqi\\\\AppData\\\\Local\\\\Temp/typora-icon.png&quot; Error from the console: 12'function' is not recognized as an internal or external command,operable program or batch file Solution: Choose Custom Command and install picgo through npm (set the config file as aforementioned) then the Command should be &quot;C:\\\\Users\\\\lcqi\\\\AppData\\\\Roaming\\\\npm\\\\picgo&quot; upload You might be interested in marktext if you don’t want to waste time in configuration. OR you might try https://pasteboard.co/ since sometimes https://sm.ms/ doesn’t work. Load .js/.css filesHow to load *.js files? Put your javascript file in your js directory under your theme, for example, luchaoqi.github.io\\themes\\next\\source\\js load it in your _layout.swig file luchaoqi.github.io\\themes\\next\\layout 1&lt;script type=&quot;text/javascript&quot; src=&quot;/js/gravity.js&quot;&gt;&lt;/script&gt; DONE! 404 errorSometimes hexo works well locally but crashes when deploying. It may happens b/c javascript is case sensitive. 123cd .deploy_gitvim .git/config# ignorecase=false Local Search Errorhttps://qiuyiwu.github.io/2019/01/25/Hexo-LocalSearch/ Comment Systemhttps://blog.zhangruipeng.me/hexo-theme-icarus/Plugins/Comment/icarus-user-guide-comment-plugins/ Themeshexo-theme-icarusOpen Graph settings: Set og:image for social sharing doesn’t work for me. Instead, code below works well: 1234567head: favicon: /img/favicon_io/pngtosvg.svg open_graph: title: type: blog url: image: img/favicon_io/avatar.jpg Two-column layout / License settings Layout configuration files follow the same format and definitions as theme configuration files. The configurations in _config.post.yml apply to all posts, and those in _config.page.yml apply to all custom pages. They both override configurations in theme configuration files. If you wish to override theme configurations only for a certain post/page, you can set them in the front-matter of that post/page. For example, you can change the code block highlight theme of a single post by setting it in that post’s front-matter like the following: 12345678910widgets: - type: recent_posts position: left - type: categories position: left - type: tags position: left So settings in _config.post.yml apply to all the posts but not custom pages (index.md…) Hexo Built-in Tag Helpers: Adding a caption to the code block https://hexo.io/docs/tag-plugins.html hexo-theme-nextHexo Next 7.7 双语切换 https://xienaoban.github.io/posts/52843.html 详细 https://tc9011.com/tags/hexo/ creative_commons seems some bugs bug fixed hexo-theme-cactuswhy is h2 showing a # hexo-theme-matery","link":"/blog/Hexo-101/"},{"title":"Reference Management Software","text":"ZoteroI transferred from Endnote to Zotero because it’s open source and I personally believe it’s easier to manage references than Endnote. Now I usually do literature survey taking notes with stylus and sync those changes across different platforms. Zotero: Setting up shared group librariesHow do I import from EndNote?EndnoteExport bibtex fileUse custimized label instead of record number(RN**) https://unimelb.libguides.com/c.php?g=565734&amp;p=3897110 https://www.rhizobia.co.nz/latex/convert tho at the end of day I found RN** should be more convenient b/c I just need to cite thoses papers consecutively Working with Google Docshttps://libguides.bates.edu/EndNote/google-docs","link":"/blog/Reference-Management-Software/"},{"title":"Pitfalls of Data Normalization","text":"解读：为什么要做特征归一化/标准化？Why do we need normalization? Normalization is not necessary for algorithms not related with distanceCorrelation test Pitfalls of Data Normalization Naive Bayes Tree-based algorithms: random forest / decision trees Normalization is required for distance-related feature engineeringTo explore conditional independency, we need to normalize data for estimation of inverse of covariance matrix – graphical lasso / PCA PCA KNN K-means SVM","link":"/blog/Pitfalls-of-Data-Normalization/"},{"title":"Reinforcement Learning: Super Mario Bros","text":"Check out my github repo for more info. https://github.com/LuchaoQi/Reinforcement_Learning Problems I metSuper long-time traning:How to prevent Google Colab from disconnecting? Still doesn’t work for me. I mean I need kernel run for longer than 24hrs probably. So I switched to remote server. Updated: Try JAX next time. Need a fake screen for env.render():env.render() seems doesn’t work with openai gym over remote server. I tried solution here https://stackoverflow.com/questions/40195740/how-to-run-openai-gym-render-over-a-server seems doens’t work for me Keep processes running after SSH session disconnectsGPU-related problemWhy my tensorflow-gpu runs only on cpu? Ubuntu https://github.com/tensorflow/tensorflow/issues/12388#issuecomment-402307127 Proposal Resourceshttps://github.com/nemanja-m/super-mario-agent https://github.com/sebastianheinz/super-mario-reinforcement-learning Server info123456789101112131415161718[lqi9@ugrad1 ~]$ lspci00:00.0 Host bridge: Intel Corporation 4th Gen Core Processor DRAM Controller (rev 06)00:01.0 PCI bridge: Intel Corporation Xeon E3-1200 v3/4th Gen Core Processor PCI Express x16 Controller (rev 06)00:14.0 USB controller: Intel Corporation 8 Series/C220 Series Chipset Family USB xHCI (rev 04)00:16.0 Communication controller: Intel Corporation 8 Series/C220 Series Chipset Family MEI Controller #1 (rev 04)00:16.3 Serial controller: Intel Corporation 8 Series/C220 Series Chipset Family KT Controller (rev 04)00:19.0 Ethernet controller: Intel Corporation Ethernet Connection I217-LM (rev 04)00:1a.0 USB controller: Intel Corporation 8 Series/C220 Series Chipset Family USB EHCI #2 (rev 04)00:1b.0 Audio device: Intel Corporation 8 Series/C220 Series Chipset High Definition Audio Controller (rev 04)00:1c.0 PCI bridge: Intel Corporation 8 Series/C220 Series Chipset Family PCI Express Root Port #1 (rev d4)00:1c.1 PCI bridge: Intel Corporation 8 Series/C220 Series Chipset Family PCI Express Root Port #2 (rev d4)00:1d.0 USB controller: Intel Corporation 8 Series/C220 Series Chipset Family USB EHCI #1 (rev 04)00:1f.0 ISA bridge: Intel Corporation Q87 Express LPC Controller (rev 04)00:1f.2 SATA controller: Intel Corporation 8 Series/C220 Series Chipset Family 6-port SATA Controller 1 [AHCI mode] (rev 04)00:1f.3 SMBus: Intel Corporation 8 Series/C220 Series Chipset Family SMBus Controller (rev 04)01:00.0 VGA compatible controller: NVIDIA Corporation GK106 [GeForce GTX 645 OEM] (rev a1)01:00.1 Audio device: NVIDIA Corporation GK106 HDMI Audio Controller (rev a1)03:00.0 PCI bridge: Texas Instruments XIO2001 PCI Express-to-PCI Bridge","link":"/blog/Reinforcement-Learning-Super-Mario-Bros/"},{"title":"Year End Recap","text":"2020 coursework thesis EAD (3 months) AB testing Leetcode Ekohealth Internship PhD application 2019 coursework funding intern/lab rotation TBME publication/manu prep DS application PhD application","link":"/blog/Year-End-Recap/"}],"tags":[],"categories":[]}